data/NASA_2DWMH_sweep/pass4_tbl35_sst_500/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (34.6 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
        220
        (
            (20.15102515 0 0)
            (23.57530523 0 0)
            (25.360044 0 0)
            (26.60880902 0 0)
            (27.58147601 0 0)
            (28.38360332 0 0)
            (29.06912167 0 0)
            (29.66949689 0 0)
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
