data/NASA_2DWMH_sweep/pass4_tbl35_sst_500/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.179574;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
        220
        (
            2.012665111
            2.308729617
            2.222280937
            2.018824869
            1.7744566
            1.522940802
            1.281567823
            1.059487432
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 0.179574;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
