data/NASA_2DWMH_sweep/pass4_tbl35_sst_500/system/bottomValues
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      bottomValues;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            surfaces;
libs            ("libsampling.so");
writeControl    writeTime;
surfaceFormat   raw;

#include "../fieldDef"

fields          $wallValuesFields;

surfaces
(
    bottomValues
    {
        type            patch;
        patches         (bottomWall);
        interpolate     false;
    }
);

// ************************************************************************* //
